AUTO_config_TK_pesok/src/Documents/Рецептура/Рецептура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Рецептура</name>
  <comment>Рецептура (технологическая карта)</comment>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <comment>Продукция, для которой собираем ингредиенты</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество продукции, которое может быть выпущено с указанными ингредиентами</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <comment>Единица измерения номенклатурной позиции</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяРецептура</name>
    <comment>Признак основной рецептуры данной продукции. Основная рецептура может быть только одна</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехнологияПроизводства</name>
    <comment>Технология производства</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаКачества</name>
    <comment>Оценка качества</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Вкус</name>
    <comment>Вкус</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Консистенция</name>
    <comment>Консистенция</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Актуальная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьВыпускПриЗагрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>Таблица товаров и услуг</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар, услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество брутто единиц измерения номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНетто</name>
      <comment>Количество нетто единиц измерения номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>Единица измерения номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентСебестоимости</name>
      <comment>Коэффициент себестоимости</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Рецептура</name>
      <type>
        <types>DocumentRef.Рецептура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапретитьАвтовыборРецептуры</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТорговыеПлощадки</name>
    <attributes>
      <name>ТорговаяПлощадка</name>
      <type>
        <types>CatalogRef.ТорговыеПлощадки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Documents/Рецептура/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс	

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Документ.ПоступлениеТоваров";
	//КомандаПечати.Идентификатор = "АктНедопоставки";
	//КомандаПечати.Представление = НСтр("ru = 'Акт недопоставки';uk='Акт недопостачання'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 		
	//МассивУсловий = Новый Массив;
	//МассивУсловий.Добавить(Новый Структура("Реквизит, Значение, ВидСравнения", "ИспользоватьЦеныИзПротоколов", Истина, ВидСравнения.Равно));	
	////МассивУсловий.Добавить(Новый Структура("Реквизит, Значение, ВидСравнения", "ЕстьРасхождения", Истина, ВидСравнения.Равно));	
	//КомандаПечати.УсловияВидимости = МассивУсловий;
	
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	КомандаОтчет = ВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	Если КомандаОтчет <> Неопределено Тогда
		КомандаОтчет.МестоРазмещения = "ПодменюОтчеты";
	КонецЕсли;
	
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ПодразделениеКомпании)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом


Функция ПолучитьАктуальнуюРецептуру(Продукция, Подразделение = Неопределено, ТолькоОсновнаяРецептура = Ложь) Экспорт 
	
	ОтборПоПодразделению = ЗначениеЗаполнено(Подразделение);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	Рецептура.Ссылка КАК Рецептура,
	               |	ВЫБОР
	               |		КОГДА Рецептура.ОсновнаяРецептура
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК Порядок,
	               |	Рецептура.Продукция КАК Продукция,
	               |	Рецептура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	Рецептура.Количество КАК Количество,
	               |	Рецептура.Коэффициент КАК Коэффициент
	               |ИЗ
	               |	Документ.Рецептура КАК Рецептура
	               |ГДЕ
	               |	Рецептура.Проведен
	               |	И Рецептура.Актуальная
	               |	И Рецептура.Продукция = &Продукция
	               |	"+ ?(ТолькоОсновнаяРецептура, "И Рецептура.ОсновнаяРецептура", "") +"									   
	               |	"+ ?(ОтборПоПодразделению, "И Рецептура.ПодразделениеКомпании = &ПодразделениеКомпании", "") +"
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок,
	               |	Рецептура.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Продукция", Продукция);
	
	Если ОтборПоПодразделению Тогда 
		Запрос.УстановитьПараметр("ПодразделениеКомпании", Подразделение);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Рецептура 			= Выборка.Рецептура;
		ЕдиницаИзмерения 	= Выборка.ЕдиницаИзмерения;
		Количество			= Выборка.Количество;
		Коэффициент			= Выборка.Коэффициент;
	Иначе
		Рецептура 			= ПредопределенноеЗначение("Документ.Рецептура.ПустаяСсылка");
		ЕдиницаИзмерения 	= ПредопределенноеЗначение("Справочник.ЕдиницыИзмерения.ПустаяСсылка");
		Количество			= 0;
		Коэффициент			= 0;		
	КонецЕсли;
	
	Структура = Новый Структура("Рецептура, ЕдиницаИзмерения, Количество, Коэффициент",
									Рецептура,
									ЕдиницаИзмерения,
									Количество,
									Коэффициент);
									
	Возврат Структура;									
	
КонецФункции

#КонецОбласти	


#Область Печать


#КонецОбласти	




#Иначе
	
#КонецЕсли
